/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "לא ניתן להשלים את הפעולה";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "נסה/י שוב מאוחר יותר.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "מבנה מדיה זה אינו נתמך.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "יתכן שמדיה זו פגומה.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "יישום זה אינו מורשה להפעיל קובץ זה."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "לא ניתן לפתוח";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "לא ניתן להשתמש במדיה זו.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "לא ניתן לפענח את הקידוד";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "מפענח הקידוד הדרוש עבור מדיה זו עמוס.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "עצור/י כל פעולה אחרת המפענחת קידוד של מדיה ונסה/י שוב.";
